{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "d1ecf4af2ac11dae",
   "metadata": {},
   "source": [
    "# BMKG - Assignment 3\n",
    "\n",
    "This notebook intends to automatically generate a SCHEMA for any given KG."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "616379e27251c82f",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-03-27T16:09:35.815262Z",
     "start_time": "2024-03-27T16:09:34.060158Z"
    }
   },
   "outputs": [],
   "source": [
    "from operator import itemgetter\n",
    "import getpass\n",
    "import os\n",
    "\n",
    "from typing import Any\n",
    "\n",
    "from rdflib import Graph\n",
    "\n",
    "from langchain_core.runnables import RunnablePassthrough, RunnableLambda\n",
    "from langchain.memory import ConversationBufferMemory\n",
    "from langchain_core.prompts import PromptTemplate, format_document\n",
    "from langchain_core.output_parsers import StrOutputParser\n",
    "from langchain_core.messages import get_buffer_string\n",
    "from langchain_openai import OpenAI\n",
    "\n",
    "from rdflib import Graph, URIRef, Literal, Namespace\n",
    "from rdflib.namespace import RDF, RDFS\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "de00d5a25be72804",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-03-27T17:04:36.242367Z",
     "start_time": "2024-03-27T17:04:36.232704Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Provide your OpenAI API Key路路路路路路路路\n"
     ]
    }
   ],
   "source": [
    "if \"OPENAI_API_KEY\" not in os.environ:\n",
    "    os.environ[\"OPENAI_API_KEY\"] = getpass.getpass(\"Provide your OpenAI API Key\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "29b25c0fea03e406",
   "metadata": {},
   "source": [
    "1) Get the RDF graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "593eb3bb",
   "metadata": {},
   "outputs": [],
   "source": [
    "WD = Namespace(\"http://www.wikidata.org/entity/\")\n",
    "RDFS = Namespace(\"http://www.w3.org/2000/01/rdf-schema#\")\n",
    "ex = Namespace(\"https://www.example.org/\")\n",
    "wdt = Namespace(\"https://www.wikidata.org/prop/direct/\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "d6fa3bf8",
   "metadata": {},
   "outputs": [],
   "source": [
    "sparql_query = \"\"\"\n",
    "SELECT DISTINCT ?drug ?drugLabel ?disease ?diseaseLabel ?cause ?causeLabel ?symptom ?symptomLabel ?sideEffect ?sideEffectLabel ?gene ?geneLabel\n",
    "WHERE {\n",
    "  ?drug wdt:P31 wd:Q12140 .  # medicine\n",
    "  ?drug wdt:P2175 ?disease .    # treats disease\n",
    "  OPTIONAL { ?disease wdt:P828 ?cause } .  # cause of disease\n",
    "  OPTIONAL { ?disease wdt:P780 ?symptom } .  # symptom/complaint of disease\n",
    "  OPTIONAL { ?drug wdt:P780 ?sideEffect } .  # potential side effect\n",
    "  OPTIONAL { ?disease wdt:P1057 ?gene } .  # gene associated with disease\n",
    "  SERVICE wikibase:label {\n",
    "    bd:serviceParam wikibase:language \"en\" .\n",
    "  }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "05f4fb15",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N448cbf7e146b4221b38c4c40704eee2b (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sparql = SPARQLWrapper(\"https://query.wikidata.org/sparql\", agent=\"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.11 (KHTML, like Gecko) Chrome/23.0.1271.64 Safari/537.11\")\n",
    "sparql.setQuery(sparql_query)\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "\n",
    "# Create an RDF graph\n",
    "g = Graph()\n",
    "\n",
    "# Bind namespaces\n",
    "g.bind(\"wd\", WD)\n",
    "g.bind(\"wdt\", wdt)\n",
    "g.bind(\"rdfs\", RDFS)\n",
    "\n",
    "# Process query results\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    drug = URIRef(result[\"drug\"][\"value\"])\n",
    "    disease = URIRef(result[\"disease\"][\"value\"])\n",
    "\n",
    "    # Add RDF types\n",
    "    g.add((drug, RDF.type, ex.Drug))\n",
    "    g.add((disease, RDF.type, ex.Disease))\n",
    "    if \"cause\" in result:\n",
    "        cause = URIRef(result[\"cause\"][\"value\"])\n",
    "        g.add((cause, RDF.type, ex.Cause))\n",
    "    if \"symptom\" in result:\n",
    "        symptom = URIRef(result[\"symptom\"][\"value\"])\n",
    "        g.add((symptom, RDF.type, ex.Symptom))\n",
    "    if \"sideEffect\" in result:\n",
    "        side_effect = URIRef(result[\"sideEffect\"][\"value\"])\n",
    "        g.add((side_effect, RDF.type, ex.SideEffect))\n",
    "    if \"gene\" in result:\n",
    "        gene = URIRef(result[\"gene\"][\"value\"])\n",
    "        g.add((gene, RDF.type, ex.Gene))\n",
    "\n",
    "    # Add labels\n",
    "    g.add((drug, RDFS.label, Literal(result[\"drugLabel\"][\"value\"])))\n",
    "    g.add((disease, RDFS.label, Literal(result[\"diseaseLabel\"][\"value\"])))\n",
    "    if \"cause\" in result:\n",
    "        g.add((cause, RDFS.label, Literal(result[\"causeLabel\"][\"value\"])))\n",
    "    if \"symptom\" in result:\n",
    "        g.add((symptom, RDFS.label, Literal(result[\"symptomLabel\"][\"value\"])))\n",
    "    if \"sideEffect\" in result:\n",
    "        g.add((side_effect, RDFS.label, Literal(result[\"sideEffectLabel\"][\"value\"])))\n",
    "    if \"gene\" in result:\n",
    "        g.add((gene, RDFS.label, Literal(result[\"geneLabel\"][\"value\"])))\n",
    "\n",
    "    # Add relationships\n",
    "    g.add((drug, ex.treats, disease))\n",
    "    if \"cause\" in result:\n",
    "        g.add((disease, ex.hasCause, cause))\n",
    "    if \"symptom\" in result:\n",
    "        g.add((disease, ex.hasSymptom, symptom))\n",
    "    if \"sideEffect\" in result:\n",
    "        g.add((drug, ex.hasSideEffect, side_effect))\n",
    "    if \"gene\" in result:\n",
    "        g.add((disease, ex.associatedGene, gene))\n",
    "\n",
    "# Serialize the graph to a TTL file\n",
    "g.serialize(destination='medical_graph.ttl', format='turtle')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "d56cc8e9240d6e3b",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-03-27T17:04:37.600606Z",
     "start_time": "2024-03-27T17:04:37.360548Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of triples:  1873\n"
     ]
    }
   ],
   "source": [
    "#opening the files to use with the llm\n",
    "with open('wikidata_drug_disease_schema.ttl', 'r') as file:\n",
    "    schema = file.read()\n",
    "    \n",
    "graph = Graph()\n",
    "graph = graph.parse(\"medical_graph.ttl\")\n",
    "\n",
    "print(\"Number of triples: \", len(graph))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "7be82a9bb3943d7f",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-03-27T17:37:48.374199Z",
     "start_time": "2024-03-27T17:37:48.342332Z"
    }
   },
   "outputs": [],
   "source": [
    "llm = OpenAI(temperature=0)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "bf55da9ace49a765",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-03-27T17:39:37.875388Z",
     "start_time": "2024-03-27T17:39:37.861901Z"
    }
   },
   "outputs": [],
   "source": [
    "from langchain_core.prompts import ChatPromptTemplate\n",
    "\n",
    "# Create the memory object that is used to add messages\n",
    "memory = ConversationBufferMemory(\n",
    "    return_messages=True, output_key=\"answer\", input_key=\"question\"\n",
    ")\n",
    "# Add a \"memory\" key to the input object\n",
    "loaded_memory = RunnablePassthrough.assign(\n",
    "    chat_history=RunnableLambda(memory.load_memory_variables) | itemgetter(\"history\"),\n",
    ")\n",
    "\n",
    "# Prompt to reformulate the question using the chat history\n",
    "reform_template = \"\"\"Given the following chat history and a follow up question,\n",
    "rephrase the follow up question to be a standalone straightforward question, in its original language.\n",
    "Do not answer the question! Just rephrase reusing information from the chat history.\n",
    "\n",
    "Chat History:\n",
    "{chat_history}\n",
    "Follow up input:\n",
    "{question}\n",
    "\n",
    "Standalone question:\n",
    "\"\"\"\n",
    "REFORM_QUESTION_PROMPT = PromptTemplate.from_template(reform_template)\n",
    "\n",
    "breakdown_template = \"\"\" Given the following question, break it down to identify the known variables. Format these variables as follows:\n",
    "Name --> Variable Type\n",
    "\n",
    "Lastly, identify what the question is looking for (including the name, if provided). Only use the information presented in the question, nothing else.\n",
    "\n",
    "Question:\n",
    "{question}\n",
    "\n",
    "Breakdown:\n",
    "\"\"\"\n",
    "BREAKDOWN_PROMPT = PromptTemplate.from_template(breakdown_template)\n",
    "\n",
    "# Prompt to ask to answer the reformulated question\n",
    "answer_template = \"\"\"Construct a valid SPARQL query based on the provided breakdown, ensuring that labels are compared in lowercase using LCASE and not directly added as triples.\n",
    "\n",
    "Based on the breakdown, the query should only retrieve the information we are looking for. Use the provided schema, although the query should not include everything!\n",
    "\n",
    "Schema:\n",
    "{schema}\n",
    "\n",
    "Breakdown:\n",
    "{breakdown}\n",
    "\n",
    "Query:\n",
    "\"\"\"\n",
    "ANSWER_PROMPT = ChatPromptTemplate.from_template(answer_template)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "28518303c93282ec",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-03-27T17:39:37.996315Z",
     "start_time": "2024-03-27T17:39:37.992940Z"
    }
   },
   "outputs": [],
   "source": [
    "# Reformulate the question using chat history\n",
    "reformulated_question = {\n",
    "    \"reformulated_question\": {\n",
    "        \"question\": lambda x: x[\"question\"],\n",
    "        \"chat_history\": lambda x: get_buffer_string(x[\"chat_history\"]),\n",
    "    }\n",
    "    | REFORM_QUESTION_PROMPT\n",
    "    | llm\n",
    "    | StrOutputParser(),\n",
    "}\n",
    "# Breakdown the question to identify what we are looking for and what we know\n",
    "question_breakdown = {\n",
    "    \"breakdown\" : {\n",
    "        \"question\": lambda x: print(\" Reformulated question:\", x[\"reformulated_question\"]) or x[\"reformulated_question\"],\n",
    "    }\n",
    "    | BREAKDOWN_PROMPT\n",
    "    | llm\n",
    "    | StrOutputParser(),\n",
    "}\n",
    "final_inputs = {\n",
    "    \"schema\": lambda x: schema,\n",
    "    \"breakdown\": lambda x: print(\" Question breakdown:\\n\", x[\"breakdown\"]) or x[\"breakdown\"],\n",
    "}\n",
    "answer = {\n",
    "    \"answer\": final_inputs | ANSWER_PROMPT | llm,\n",
    "}\n",
    "# Put the chain together\n",
    "final_chain = loaded_memory | reformulated_question | question_breakdown | answer\n",
    "\n",
    "def stream_chain(final_chain, memory: ConversationBufferMemory, inputs_list: list[dict[str, str]]) -> dict[str, Any]:\n",
    "    \"\"\"Ask questions, stream the answer output, and return the answers.\"\"\"\n",
    "    output = {\"answer\": []}\n",
    "    for inputs in inputs_list:\n",
    "        answer_output = \"\"\n",
    "        for chunk in final_chain.stream(inputs):\n",
    "            if \"answer\" in chunk:\n",
    "                answer_output += chunk[\"answer\"]\n",
    "                print(chunk[\"answer\"], end=\"\", flush=True)\n",
    "        \n",
    "        output[\"answer\"].append(answer_output)\n",
    "        # Add messages to chat history\n",
    "        memory.save_context(inputs, {\"answer\": answer_output})\n",
    "    \n",
    "    return output"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "5ee43039f6f4af97",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-03-27T17:41:29.237541Z",
     "start_time": "2024-03-27T17:41:26.017540Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " Reformulated question: What disease is caused by 'food'?\n",
      " Question breakdown:\n",
      " \n",
      "Known Variables:\n",
      "- Disease --> String\n",
      "- Food --> String\n",
      "\n",
      "Question is looking for:\n",
      "- The name of the disease caused by 'food'\n",
      "PREFIX ns1: <https://www.example.org/>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX wd: <http://www.wikidata.org/entity/>\n",
      "\n",
      "SELECT ?diseaseLabel\n",
      "WHERE {\n",
      "    ?diseaseURI a ns1:Disease ;\n",
      "        rdfs:label ?diseaseLabel ;\n",
      "        ns1:hasCause ?causeURI .\n",
      "    ?causeURI a ns1:Cause ;\n",
      "        rdfs:label ?causeLabel .\n",
      "    FILTER(LCASE(?causeLabel) = LCASE(\"food\"))\n",
      "}"
     ]
    }
   ],
   "source": [
    "questions = [\n",
    "    {\"question\": \"What disease is caused by 'food?\"},\n",
    "]\n",
    "output = stream_chain(final_chain, memory, questions)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "678433e5606a55da",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-03-27T17:41:37.244014Z",
     "start_time": "2024-03-27T17:41:37.240161Z"
    }
   },
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import rdflib\n",
    "\n",
    "from IPython.display import display, HTML\n",
    "from pygments import highlight\n",
    "from pygments.lexers import SparqlLexer\n",
    "from pygments.formatters import HtmlFormatter\n",
    "\n",
    "def run_query(graph, query, entity=None):\n",
    "    # Execute the SPARQL query\n",
    "    results = graph.query(query, initBindings={'entity': entity})\n",
    "    \n",
    "    # Display the SPARQL query\n",
    "    formatted_query = highlight(query, SparqlLexer(), HtmlFormatter(style='solarized-dark', full=True, nobackground=True))\n",
    "    display(HTML(formatted_query))\n",
    "    \n",
    "    # Convert results to a Pandas DataFrame\n",
    "    res_list = []\n",
    "    for row in results:\n",
    "        res_list.append([str(item) for item in row])\n",
    "    df = pd.DataFrame(res_list, columns=[str(var) for var in results.vars]) if len(res_list) > 0 else pd.DataFrame()\n",
    "\n",
    "    # Display the DataFrame as a table in Jupyter Notebook\n",
    "    display(HTML(df.to_html()))\n",
    "    \n",
    "    if(len(df) > 1):\n",
    "        return df.iloc[0, 0]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "15dd22680f0b1a4d",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-03-27T17:41:37.794198Z",
     "start_time": "2024-03-27T17:41:37.594527Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX ns1: <https://www.example.org/>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX wd: <http://www.wikidata.org/entity/>\n",
      "\n",
      "SELECT ?diseaseLabel\n",
      "WHERE {\n",
      "    ?diseaseURI a ns1:Disease ;\n",
      "        rdfs:label ?diseaseLabel ;\n",
      "        ns1:hasCause ?causeURI .\n",
      "    ?causeURI a ns1:Cause ;\n",
      "        rdfs:label ?causeLabel .\n",
      "    FILTER(LCASE(?causeLabel) = LCASE(\"food\"))\n",
      "}\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01//EN\"\n",
       "   \"http://www.w3.org/TR/html4/strict.dtd\">\n",
       "<!--\n",
       "generated by Pygments <https://pygments.org/>\n",
       "Copyright 2006-2023 by the Pygments team.\n",
       "Licensed under the BSD license, see LICENSE for details.\n",
       "-->\n",
       "<html>\n",
       "<head>\n",
       "  <title></title>\n",
       "  <meta http-equiv=\"content-type\" content=\"text/html; charset=None\">\n",
       "  <style type=\"text/css\">\n",
       "/*\n",
       "generated by Pygments <https://pygments.org/>\n",
       "Copyright 2006-2023 by the Pygments team.\n",
       "Licensed under the BSD license, see LICENSE for details.\n",
       "*/\n",
       "pre { line-height: 125%; }\n",
       "td.linenos .normal { color: #586e75; background-color: #073642; padding-left: 5px; padding-right: 5px; }\n",
       "span.linenos { color: #586e75; background-color: #073642; padding-left: 5px; padding-right: 5px; }\n",
       "td.linenos .special { color: #000000; background-color: #ffffc0; padding-left: 5px; padding-right: 5px; }\n",
       "span.linenos.special { color: #000000; background-color: #ffffc0; padding-left: 5px; padding-right: 5px; }\n",
       "body .hll { background-color: #073642 }\n",
       "body .c { color: #586e75; font-style: italic } /* Comment */\n",
       "body .err { color: #839496; background-color: #dc322f } /* Error */\n",
       "body .esc { color: #839496 } /* Escape */\n",
       "body .g { color: #839496 } /* Generic */\n",
       "body .k { color: #859900 } /* Keyword */\n",
       "body .l { color: #839496 } /* Literal */\n",
       "body .n { color: #839496 } /* Name */\n",
       "body .o { color: #586e75 } /* Operator */\n",
       "body .x { color: #839496 } /* Other */\n",
       "body .p { color: #839496 } /* Punctuation */\n",
       "body .ch { color: #586e75; font-style: italic } /* Comment.Hashbang */\n",
       "body .cm { color: #586e75; font-style: italic } /* Comment.Multiline */\n",
       "body .cp { color: #d33682 } /* Comment.Preproc */\n",
       "body .cpf { color: #586e75 } /* Comment.PreprocFile */\n",
       "body .c1 { color: #586e75; font-style: italic } /* Comment.Single */\n",
       "body .cs { color: #586e75; font-style: italic } /* Comment.Special */\n",
       "body .gd { color: #dc322f } /* Generic.Deleted */\n",
       "body .ge { color: #839496; font-style: italic } /* Generic.Emph */\n",
       "body .gr { color: #dc322f } /* Generic.Error */\n",
       "body .gh { color: #839496; font-weight: bold } /* Generic.Heading */\n",
       "body .gi { color: #859900 } /* Generic.Inserted */\n",
       "body .go { color: #839496 } /* Generic.Output */\n",
       "body .gp { color: #268bd2; font-weight: bold } /* Generic.Prompt */\n",
       "body .gs { color: #839496; font-weight: bold } /* Generic.Strong */\n",
       "body .gu { color: #839496; text-decoration: underline } /* Generic.Subheading */\n",
       "body .gt { color: #268bd2 } /* Generic.Traceback */\n",
       "body .kc { color: #2aa198 } /* Keyword.Constant */\n",
       "body .kd { color: #2aa198 } /* Keyword.Declaration */\n",
       "body .kn { color: #cb4b16 } /* Keyword.Namespace */\n",
       "body .kp { color: #859900 } /* Keyword.Pseudo */\n",
       "body .kr { color: #859900 } /* Keyword.Reserved */\n",
       "body .kt { color: #b58900 } /* Keyword.Type */\n",
       "body .ld { color: #839496 } /* Literal.Date */\n",
       "body .m { color: #2aa198 } /* Literal.Number */\n",
       "body .s { color: #2aa198 } /* Literal.String */\n",
       "body .na { color: #839496 } /* Name.Attribute */\n",
       "body .nb { color: #268bd2 } /* Name.Builtin */\n",
       "body .nc { color: #268bd2 } /* Name.Class */\n",
       "body .no { color: #268bd2 } /* Name.Constant */\n",
       "body .nd { color: #268bd2 } /* Name.Decorator */\n",
       "body .ni { color: #268bd2 } /* Name.Entity */\n",
       "body .ne { color: #268bd2 } /* Name.Exception */\n",
       "body .nf { color: #268bd2 } /* Name.Function */\n",
       "body .nl { color: #268bd2 } /* Name.Label */\n",
       "body .nn { color: #268bd2 } /* Name.Namespace */\n",
       "body .nx { color: #839496 } /* Name.Other */\n",
       "body .py { color: #839496 } /* Name.Property */\n",
       "body .nt { color: #268bd2 } /* Name.Tag */\n",
       "body .nv { color: #268bd2 } /* Name.Variable */\n",
       "body .ow { color: #859900 } /* Operator.Word */\n",
       "body .pm { color: #839496 } /* Punctuation.Marker */\n",
       "body .w { color: #839496 } /* Text.Whitespace */\n",
       "body .mb { color: #2aa198 } /* Literal.Number.Bin */\n",
       "body .mf { color: #2aa198 } /* Literal.Number.Float */\n",
       "body .mh { color: #2aa198 } /* Literal.Number.Hex */\n",
       "body .mi { color: #2aa198 } /* Literal.Number.Integer */\n",
       "body .mo { color: #2aa198 } /* Literal.Number.Oct */\n",
       "body .sa { color: #2aa198 } /* Literal.String.Affix */\n",
       "body .sb { color: #2aa198 } /* Literal.String.Backtick */\n",
       "body .sc { color: #2aa198 } /* Literal.String.Char */\n",
       "body .dl { color: #2aa198 } /* Literal.String.Delimiter */\n",
       "body .sd { color: #586e75 } /* Literal.String.Doc */\n",
       "body .s2 { color: #2aa198 } /* Literal.String.Double */\n",
       "body .se { color: #2aa198 } /* Literal.String.Escape */\n",
       "body .sh { color: #2aa198 } /* Literal.String.Heredoc */\n",
       "body .si { color: #2aa198 } /* Literal.String.Interpol */\n",
       "body .sx { color: #2aa198 } /* Literal.String.Other */\n",
       "body .sr { color: #cb4b16 } /* Literal.String.Regex */\n",
       "body .s1 { color: #2aa198 } /* Literal.String.Single */\n",
       "body .ss { color: #2aa198 } /* Literal.String.Symbol */\n",
       "body .bp { color: #268bd2 } /* Name.Builtin.Pseudo */\n",
       "body .fm { color: #268bd2 } /* Name.Function.Magic */\n",
       "body .vc { color: #268bd2 } /* Name.Variable.Class */\n",
       "body .vg { color: #268bd2 } /* Name.Variable.Global */\n",
       "body .vi { color: #268bd2 } /* Name.Variable.Instance */\n",
       "body .vm { color: #268bd2 } /* Name.Variable.Magic */\n",
       "body .il { color: #2aa198 } /* Literal.Number.Integer.Long */\n",
       "\n",
       "  </style>\n",
       "</head>\n",
       "<body>\n",
       "<h2></h2>\n",
       "\n",
       "<div class=\"highlight\"><pre><span></span><span class=\"k\">PREFIX</span> <span class=\"nn\">ns1</span><span class=\"p\">:</span> <span class=\"nl\">&lt;https://www.example.org/&gt;</span>\n",
       "<span class=\"k\">PREFIX</span> <span class=\"nn\">rdfs</span><span class=\"p\">:</span> <span class=\"nl\">&lt;http://www.w3.org/2000/01/rdf-schema#&gt;</span>\n",
       "<span class=\"k\">PREFIX</span> <span class=\"nn\">wd</span><span class=\"p\">:</span> <span class=\"nl\">&lt;http://www.wikidata.org/entity/&gt;</span>\n",
       "\n",
       "<span class=\"k\">SELECT</span> <span class=\"nv\">?diseaseLabel</span>\n",
       "<span class=\"k\">WHERE</span> <span class=\"p\">{</span>\n",
       "    <span class=\"nv\">?diseaseURI</span> <span class=\"k\">a</span> <span class=\"nn\">ns1</span><span class=\"p\">:</span><span class=\"nt\">Disease</span> <span class=\"p\">;</span>\n",
       "        <span class=\"nn\">rdfs</span><span class=\"p\">:</span><span class=\"nt\">label</span> <span class=\"nv\">?diseaseLabel</span> <span class=\"p\">;</span>\n",
       "        <span class=\"nn\">ns1</span><span class=\"p\">:</span><span class=\"nt\">hasCause</span> <span class=\"nv\">?causeURI</span> <span class=\"p\">.</span>\n",
       "    <span class=\"nv\">?causeURI</span> <span class=\"k\">a</span> <span class=\"nn\">ns1</span><span class=\"p\">:</span><span class=\"nt\">Cause</span> <span class=\"p\">;</span>\n",
       "        <span class=\"nn\">rdfs</span><span class=\"p\">:</span><span class=\"nt\">label</span> <span class=\"nv\">?causeLabel</span> <span class=\"p\">.</span>\n",
       "    <span class=\"k\">FILTER</span><span class=\"p\">(</span><span class=\"nf\">LCASE</span><span class=\"p\">(</span><span class=\"nv\">?causeLabel</span><span class=\"p\">)</span> <span class=\"o\">=</span> <span class=\"nf\">LCASE</span><span class=\"p\">(</span><span class=\"s\">&quot;food&quot;</span><span class=\"p\">))</span>\n",
       "<span class=\"p\">}</span>\n",
       "</pre></div>\n",
       "</body>\n",
       "</html>\n"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>diseaseLabel</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>food allergy</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "None\n"
     ]
    }
   ],
   "source": [
    "for answer_output in output[\"answer\"]:\n",
    "    run_query(graph, answer_output)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "6dd8b868",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_uri_from_label(label, graph):\n",
    "    \"\"\"\n",
    "    Given a human-readable label and a graph, return the URI corresponding to the label.\n",
    "    If multiple URIs exist for a given label, this function returns the first match.\n",
    "    \"\"\"\n",
    "    sparql_query = \"\"\"\n",
    "    SELECT ?entity WHERE {\n",
    "        ?entity rdfs:label ?label .\n",
    "        FILTER (LCASE(STR(?label)) = LCASE(?input_label))\n",
    "    }\n",
    "    LIMIT 1\n",
    "    \"\"\"\n",
    "    query_result = graph.query(sparql_query, initBindings={'input_label': rdflib.Literal(label)})\n",
    "    for row in query_result:\n",
    "        return row[0]  # Return the first (and hopefully only) URI that matches the label\n",
    "    return None  # Return None if no matching URI is foun"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "c361d680",
   "metadata": {},
   "outputs": [],
   "source": [
    "#To combine our multi-hop reasoning with our llm, we ask the llm two questions, and we try to find the link between them.\n",
    "import rdflib\n",
    "import networkx as nx\n",
    "from rdflib.extras.external_graph_libs import rdflib_to_networkx_digraph\n",
    "from rdflib.extras.external_graph_libs import rdflib_to_networkx_multidigraph\n",
    "\n",
    "def multi_hop_questioning(question1, question2, graph, final_chain, memory):\n",
    "\n",
    "    #now we have our questions ready, we find our answers\n",
    "    question1 = [\n",
    "            {\"question\" : question1},\n",
    "    ]\n",
    "    output1 = stream_chain(final_chain, memory, question1)\n",
    "    question2 = [\n",
    "            {\"question\": question2},\n",
    "    ]\n",
    "    output2 = stream_chain(final_chain, memory, question2)\n",
    "    \n",
    "    for answer_output in output1[\"answer\"]:\n",
    "        print(answer_output)\n",
    "        answer1 = run_query(graph, answer_output)\n",
    "        \n",
    "    for answer_output in output2[\"answer\"]:\n",
    "        print(answer_output)\n",
    "        answer2 = run_query(graph, answer_output)\n",
    "\n",
    "    dg = rdflib_to_networkx_digraph(graph)\n",
    "    \n",
    "    query_entity = get_uri_from_label(answer1, graph)\n",
    "    target_relation = get_uri_from_label(answer2, graph)\n",
    "    \n",
    "    visited = set()\n",
    "    queue = [(query_entity, [])]  # Start with the query entity and an empty relation path\n",
    "    while queue:\n",
    "        entity, relation_path = queue.pop(0)\n",
    "        if entity == target_relation:\n",
    "            return relation_path\n",
    "        if entity not in visited:\n",
    "            visited.add(entity)\n",
    "            for neighbor in dg.neighbors(entity):\n",
    "                new_path = relation_path + [(entity, neighbor)]\n",
    "                queue.append((neighbor, new_path))\n",
    "    return None"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "12339661",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " Reformulated question: What causes does the disease 'food allergy' have?\n",
      " Question breakdown:\n",
      " \n",
      "Known Variables:\n",
      "- Disease: String\n",
      "\n",
      "Question is looking for:\n",
      "- Causes of food allergy\n",
      "PREFIX ns1: <https://www.example.org/>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX wd: <http://www.wikidata.org/entity/>\n",
      "\n",
      "SELECT ?causeLabel\n",
      "WHERE {\n",
      "    ?diseaseURI a ns1:Disease ;\n",
      "        rdfs:label ?diseaseLabel ;\n",
      "        ns1:hasCause ?causeURI .\n",
      "    ?causeURI a ns1:Cause ;\n",
      "        rdfs:label ?causeLabel .\n",
      "    FILTER(LCASE(?diseaseLabel) = \"food allergy\")\n",
      "} Reformulated question: What disease is caused by 'food'?\n",
      " Question breakdown:\n",
      " \n",
      "Known Variables:\n",
      "- Disease --> String\n",
      "- Food --> String\n",
      "\n",
      "Question is looking for:\n",
      "- The name of the disease caused by 'food'\n",
      "PREFIX ns1: <https://www.example.org/>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX wd: <http://www.wikidata.org/entity/>\n",
      "\n",
      "SELECT ?diseaseLabel\n",
      "WHERE {\n",
      "    ?diseaseURI a ns1:Disease ;\n",
      "        rdfs:label ?diseaseLabel ;\n",
      "        ns1:hasCause ?causeURI .\n",
      "    ?causeURI a ns1:Cause ;\n",
      "        rdfs:label ?causeLabel .\n",
      "    FILTER(LCASE(?causeLabel) = LCASE(\"food\"))\n",
      "}PREFIX ns1: <https://www.example.org/>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX wd: <http://www.wikidata.org/entity/>\n",
      "\n",
      "SELECT ?causeLabel\n",
      "WHERE {\n",
      "    ?diseaseURI a ns1:Disease ;\n",
      "        rdfs:label ?diseaseLabel ;\n",
      "        ns1:hasCause ?causeURI .\n",
      "    ?causeURI a ns1:Cause ;\n",
      "        rdfs:label ?causeLabel .\n",
      "    FILTER(LCASE(?diseaseLabel) = \"food allergy\")\n",
      "}\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01//EN\"\n",
       "   \"http://www.w3.org/TR/html4/strict.dtd\">\n",
       "<!--\n",
       "generated by Pygments <https://pygments.org/>\n",
       "Copyright 2006-2023 by the Pygments team.\n",
       "Licensed under the BSD license, see LICENSE for details.\n",
       "-->\n",
       "<html>\n",
       "<head>\n",
       "  <title></title>\n",
       "  <meta http-equiv=\"content-type\" content=\"text/html; charset=None\">\n",
       "  <style type=\"text/css\">\n",
       "/*\n",
       "generated by Pygments <https://pygments.org/>\n",
       "Copyright 2006-2023 by the Pygments team.\n",
       "Licensed under the BSD license, see LICENSE for details.\n",
       "*/\n",
       "pre { line-height: 125%; }\n",
       "td.linenos .normal { color: #586e75; background-color: #073642; padding-left: 5px; padding-right: 5px; }\n",
       "span.linenos { color: #586e75; background-color: #073642; padding-left: 5px; padding-right: 5px; }\n",
       "td.linenos .special { color: #000000; background-color: #ffffc0; padding-left: 5px; padding-right: 5px; }\n",
       "span.linenos.special { color: #000000; background-color: #ffffc0; padding-left: 5px; padding-right: 5px; }\n",
       "body .hll { background-color: #073642 }\n",
       "body .c { color: #586e75; font-style: italic } /* Comment */\n",
       "body .err { color: #839496; background-color: #dc322f } /* Error */\n",
       "body .esc { color: #839496 } /* Escape */\n",
       "body .g { color: #839496 } /* Generic */\n",
       "body .k { color: #859900 } /* Keyword */\n",
       "body .l { color: #839496 } /* Literal */\n",
       "body .n { color: #839496 } /* Name */\n",
       "body .o { color: #586e75 } /* Operator */\n",
       "body .x { color: #839496 } /* Other */\n",
       "body .p { color: #839496 } /* Punctuation */\n",
       "body .ch { color: #586e75; font-style: italic } /* Comment.Hashbang */\n",
       "body .cm { color: #586e75; font-style: italic } /* Comment.Multiline */\n",
       "body .cp { color: #d33682 } /* Comment.Preproc */\n",
       "body .cpf { color: #586e75 } /* Comment.PreprocFile */\n",
       "body .c1 { color: #586e75; font-style: italic } /* Comment.Single */\n",
       "body .cs { color: #586e75; font-style: italic } /* Comment.Special */\n",
       "body .gd { color: #dc322f } /* Generic.Deleted */\n",
       "body .ge { color: #839496; font-style: italic } /* Generic.Emph */\n",
       "body .gr { color: #dc322f } /* Generic.Error */\n",
       "body .gh { color: #839496; font-weight: bold } /* Generic.Heading */\n",
       "body .gi { color: #859900 } /* Generic.Inserted */\n",
       "body .go { color: #839496 } /* Generic.Output */\n",
       "body .gp { color: #268bd2; font-weight: bold } /* Generic.Prompt */\n",
       "body .gs { color: #839496; font-weight: bold } /* Generic.Strong */\n",
       "body .gu { color: #839496; text-decoration: underline } /* Generic.Subheading */\n",
       "body .gt { color: #268bd2 } /* Generic.Traceback */\n",
       "body .kc { color: #2aa198 } /* Keyword.Constant */\n",
       "body .kd { color: #2aa198 } /* Keyword.Declaration */\n",
       "body .kn { color: #cb4b16 } /* Keyword.Namespace */\n",
       "body .kp { color: #859900 } /* Keyword.Pseudo */\n",
       "body .kr { color: #859900 } /* Keyword.Reserved */\n",
       "body .kt { color: #b58900 } /* Keyword.Type */\n",
       "body .ld { color: #839496 } /* Literal.Date */\n",
       "body .m { color: #2aa198 } /* Literal.Number */\n",
       "body .s { color: #2aa198 } /* Literal.String */\n",
       "body .na { color: #839496 } /* Name.Attribute */\n",
       "body .nb { color: #268bd2 } /* Name.Builtin */\n",
       "body .nc { color: #268bd2 } /* Name.Class */\n",
       "body .no { color: #268bd2 } /* Name.Constant */\n",
       "body .nd { color: #268bd2 } /* Name.Decorator */\n",
       "body .ni { color: #268bd2 } /* Name.Entity */\n",
       "body .ne { color: #268bd2 } /* Name.Exception */\n",
       "body .nf { color: #268bd2 } /* Name.Function */\n",
       "body .nl { color: #268bd2 } /* Name.Label */\n",
       "body .nn { color: #268bd2 } /* Name.Namespace */\n",
       "body .nx { color: #839496 } /* Name.Other */\n",
       "body .py { color: #839496 } /* Name.Property */\n",
       "body .nt { color: #268bd2 } /* Name.Tag */\n",
       "body .nv { color: #268bd2 } /* Name.Variable */\n",
       "body .ow { color: #859900 } /* Operator.Word */\n",
       "body .pm { color: #839496 } /* Punctuation.Marker */\n",
       "body .w { color: #839496 } /* Text.Whitespace */\n",
       "body .mb { color: #2aa198 } /* Literal.Number.Bin */\n",
       "body .mf { color: #2aa198 } /* Literal.Number.Float */\n",
       "body .mh { color: #2aa198 } /* Literal.Number.Hex */\n",
       "body .mi { color: #2aa198 } /* Literal.Number.Integer */\n",
       "body .mo { color: #2aa198 } /* Literal.Number.Oct */\n",
       "body .sa { color: #2aa198 } /* Literal.String.Affix */\n",
       "body .sb { color: #2aa198 } /* Literal.String.Backtick */\n",
       "body .sc { color: #2aa198 } /* Literal.String.Char */\n",
       "body .dl { color: #2aa198 } /* Literal.String.Delimiter */\n",
       "body .sd { color: #586e75 } /* Literal.String.Doc */\n",
       "body .s2 { color: #2aa198 } /* Literal.String.Double */\n",
       "body .se { color: #2aa198 } /* Literal.String.Escape */\n",
       "body .sh { color: #2aa198 } /* Literal.String.Heredoc */\n",
       "body .si { color: #2aa198 } /* Literal.String.Interpol */\n",
       "body .sx { color: #2aa198 } /* Literal.String.Other */\n",
       "body .sr { color: #cb4b16 } /* Literal.String.Regex */\n",
       "body .s1 { color: #2aa198 } /* Literal.String.Single */\n",
       "body .ss { color: #2aa198 } /* Literal.String.Symbol */\n",
       "body .bp { color: #268bd2 } /* Name.Builtin.Pseudo */\n",
       "body .fm { color: #268bd2 } /* Name.Function.Magic */\n",
       "body .vc { color: #268bd2 } /* Name.Variable.Class */\n",
       "body .vg { color: #268bd2 } /* Name.Variable.Global */\n",
       "body .vi { color: #268bd2 } /* Name.Variable.Instance */\n",
       "body .vm { color: #268bd2 } /* Name.Variable.Magic */\n",
       "body .il { color: #2aa198 } /* Literal.Number.Integer.Long */\n",
       "\n",
       "  </style>\n",
       "</head>\n",
       "<body>\n",
       "<h2></h2>\n",
       "\n",
       "<div class=\"highlight\"><pre><span></span><span class=\"k\">PREFIX</span> <span class=\"nn\">ns1</span><span class=\"p\">:</span> <span class=\"nl\">&lt;https://www.example.org/&gt;</span>\n",
       "<span class=\"k\">PREFIX</span> <span class=\"nn\">rdfs</span><span class=\"p\">:</span> <span class=\"nl\">&lt;http://www.w3.org/2000/01/rdf-schema#&gt;</span>\n",
       "<span class=\"k\">PREFIX</span> <span class=\"nn\">wd</span><span class=\"p\">:</span> <span class=\"nl\">&lt;http://www.wikidata.org/entity/&gt;</span>\n",
       "\n",
       "<span class=\"k\">SELECT</span> <span class=\"nv\">?causeLabel</span>\n",
       "<span class=\"k\">WHERE</span> <span class=\"p\">{</span>\n",
       "    <span class=\"nv\">?diseaseURI</span> <span class=\"k\">a</span> <span class=\"nn\">ns1</span><span class=\"p\">:</span><span class=\"nt\">Disease</span> <span class=\"p\">;</span>\n",
       "        <span class=\"nn\">rdfs</span><span class=\"p\">:</span><span class=\"nt\">label</span> <span class=\"nv\">?diseaseLabel</span> <span class=\"p\">;</span>\n",
       "        <span class=\"nn\">ns1</span><span class=\"p\">:</span><span class=\"nt\">hasCause</span> <span class=\"nv\">?causeURI</span> <span class=\"p\">.</span>\n",
       "    <span class=\"nv\">?causeURI</span> <span class=\"k\">a</span> <span class=\"nn\">ns1</span><span class=\"p\">:</span><span class=\"nt\">Cause</span> <span class=\"p\">;</span>\n",
       "        <span class=\"nn\">rdfs</span><span class=\"p\">:</span><span class=\"nt\">label</span> <span class=\"nv\">?causeLabel</span> <span class=\"p\">.</span>\n",
       "    <span class=\"k\">FILTER</span><span class=\"p\">(</span><span class=\"nf\">LCASE</span><span class=\"p\">(</span><span class=\"nv\">?diseaseLabel</span><span class=\"p\">)</span> <span class=\"o\">=</span> <span class=\"s\">&quot;food allergy&quot;</span><span class=\"p\">)</span>\n",
       "<span class=\"p\">}</span>\n",
       "</pre></div>\n",
       "</body>\n",
       "</html>\n"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>causeLabel</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>food</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>food allergen</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX ns1: <https://www.example.org/>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX wd: <http://www.wikidata.org/entity/>\n",
      "\n",
      "SELECT ?diseaseLabel\n",
      "WHERE {\n",
      "    ?diseaseURI a ns1:Disease ;\n",
      "        rdfs:label ?diseaseLabel ;\n",
      "        ns1:hasCause ?causeURI .\n",
      "    ?causeURI a ns1:Cause ;\n",
      "        rdfs:label ?causeLabel .\n",
      "    FILTER(LCASE(?causeLabel) = LCASE(\"food\"))\n",
      "}\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01//EN\"\n",
       "   \"http://www.w3.org/TR/html4/strict.dtd\">\n",
       "<!--\n",
       "generated by Pygments <https://pygments.org/>\n",
       "Copyright 2006-2023 by the Pygments team.\n",
       "Licensed under the BSD license, see LICENSE for details.\n",
       "-->\n",
       "<html>\n",
       "<head>\n",
       "  <title></title>\n",
       "  <meta http-equiv=\"content-type\" content=\"text/html; charset=None\">\n",
       "  <style type=\"text/css\">\n",
       "/*\n",
       "generated by Pygments <https://pygments.org/>\n",
       "Copyright 2006-2023 by the Pygments team.\n",
       "Licensed under the BSD license, see LICENSE for details.\n",
       "*/\n",
       "pre { line-height: 125%; }\n",
       "td.linenos .normal { color: #586e75; background-color: #073642; padding-left: 5px; padding-right: 5px; }\n",
       "span.linenos { color: #586e75; background-color: #073642; padding-left: 5px; padding-right: 5px; }\n",
       "td.linenos .special { color: #000000; background-color: #ffffc0; padding-left: 5px; padding-right: 5px; }\n",
       "span.linenos.special { color: #000000; background-color: #ffffc0; padding-left: 5px; padding-right: 5px; }\n",
       "body .hll { background-color: #073642 }\n",
       "body .c { color: #586e75; font-style: italic } /* Comment */\n",
       "body .err { color: #839496; background-color: #dc322f } /* Error */\n",
       "body .esc { color: #839496 } /* Escape */\n",
       "body .g { color: #839496 } /* Generic */\n",
       "body .k { color: #859900 } /* Keyword */\n",
       "body .l { color: #839496 } /* Literal */\n",
       "body .n { color: #839496 } /* Name */\n",
       "body .o { color: #586e75 } /* Operator */\n",
       "body .x { color: #839496 } /* Other */\n",
       "body .p { color: #839496 } /* Punctuation */\n",
       "body .ch { color: #586e75; font-style: italic } /* Comment.Hashbang */\n",
       "body .cm { color: #586e75; font-style: italic } /* Comment.Multiline */\n",
       "body .cp { color: #d33682 } /* Comment.Preproc */\n",
       "body .cpf { color: #586e75 } /* Comment.PreprocFile */\n",
       "body .c1 { color: #586e75; font-style: italic } /* Comment.Single */\n",
       "body .cs { color: #586e75; font-style: italic } /* Comment.Special */\n",
       "body .gd { color: #dc322f } /* Generic.Deleted */\n",
       "body .ge { color: #839496; font-style: italic } /* Generic.Emph */\n",
       "body .gr { color: #dc322f } /* Generic.Error */\n",
       "body .gh { color: #839496; font-weight: bold } /* Generic.Heading */\n",
       "body .gi { color: #859900 } /* Generic.Inserted */\n",
       "body .go { color: #839496 } /* Generic.Output */\n",
       "body .gp { color: #268bd2; font-weight: bold } /* Generic.Prompt */\n",
       "body .gs { color: #839496; font-weight: bold } /* Generic.Strong */\n",
       "body .gu { color: #839496; text-decoration: underline } /* Generic.Subheading */\n",
       "body .gt { color: #268bd2 } /* Generic.Traceback */\n",
       "body .kc { color: #2aa198 } /* Keyword.Constant */\n",
       "body .kd { color: #2aa198 } /* Keyword.Declaration */\n",
       "body .kn { color: #cb4b16 } /* Keyword.Namespace */\n",
       "body .kp { color: #859900 } /* Keyword.Pseudo */\n",
       "body .kr { color: #859900 } /* Keyword.Reserved */\n",
       "body .kt { color: #b58900 } /* Keyword.Type */\n",
       "body .ld { color: #839496 } /* Literal.Date */\n",
       "body .m { color: #2aa198 } /* Literal.Number */\n",
       "body .s { color: #2aa198 } /* Literal.String */\n",
       "body .na { color: #839496 } /* Name.Attribute */\n",
       "body .nb { color: #268bd2 } /* Name.Builtin */\n",
       "body .nc { color: #268bd2 } /* Name.Class */\n",
       "body .no { color: #268bd2 } /* Name.Constant */\n",
       "body .nd { color: #268bd2 } /* Name.Decorator */\n",
       "body .ni { color: #268bd2 } /* Name.Entity */\n",
       "body .ne { color: #268bd2 } /* Name.Exception */\n",
       "body .nf { color: #268bd2 } /* Name.Function */\n",
       "body .nl { color: #268bd2 } /* Name.Label */\n",
       "body .nn { color: #268bd2 } /* Name.Namespace */\n",
       "body .nx { color: #839496 } /* Name.Other */\n",
       "body .py { color: #839496 } /* Name.Property */\n",
       "body .nt { color: #268bd2 } /* Name.Tag */\n",
       "body .nv { color: #268bd2 } /* Name.Variable */\n",
       "body .ow { color: #859900 } /* Operator.Word */\n",
       "body .pm { color: #839496 } /* Punctuation.Marker */\n",
       "body .w { color: #839496 } /* Text.Whitespace */\n",
       "body .mb { color: #2aa198 } /* Literal.Number.Bin */\n",
       "body .mf { color: #2aa198 } /* Literal.Number.Float */\n",
       "body .mh { color: #2aa198 } /* Literal.Number.Hex */\n",
       "body .mi { color: #2aa198 } /* Literal.Number.Integer */\n",
       "body .mo { color: #2aa198 } /* Literal.Number.Oct */\n",
       "body .sa { color: #2aa198 } /* Literal.String.Affix */\n",
       "body .sb { color: #2aa198 } /* Literal.String.Backtick */\n",
       "body .sc { color: #2aa198 } /* Literal.String.Char */\n",
       "body .dl { color: #2aa198 } /* Literal.String.Delimiter */\n",
       "body .sd { color: #586e75 } /* Literal.String.Doc */\n",
       "body .s2 { color: #2aa198 } /* Literal.String.Double */\n",
       "body .se { color: #2aa198 } /* Literal.String.Escape */\n",
       "body .sh { color: #2aa198 } /* Literal.String.Heredoc */\n",
       "body .si { color: #2aa198 } /* Literal.String.Interpol */\n",
       "body .sx { color: #2aa198 } /* Literal.String.Other */\n",
       "body .sr { color: #cb4b16 } /* Literal.String.Regex */\n",
       "body .s1 { color: #2aa198 } /* Literal.String.Single */\n",
       "body .ss { color: #2aa198 } /* Literal.String.Symbol */\n",
       "body .bp { color: #268bd2 } /* Name.Builtin.Pseudo */\n",
       "body .fm { color: #268bd2 } /* Name.Function.Magic */\n",
       "body .vc { color: #268bd2 } /* Name.Variable.Class */\n",
       "body .vg { color: #268bd2 } /* Name.Variable.Global */\n",
       "body .vi { color: #268bd2 } /* Name.Variable.Instance */\n",
       "body .vm { color: #268bd2 } /* Name.Variable.Magic */\n",
       "body .il { color: #2aa198 } /* Literal.Number.Integer.Long */\n",
       "\n",
       "  </style>\n",
       "</head>\n",
       "<body>\n",
       "<h2></h2>\n",
       "\n",
       "<div class=\"highlight\"><pre><span></span><span class=\"k\">PREFIX</span> <span class=\"nn\">ns1</span><span class=\"p\">:</span> <span class=\"nl\">&lt;https://www.example.org/&gt;</span>\n",
       "<span class=\"k\">PREFIX</span> <span class=\"nn\">rdfs</span><span class=\"p\">:</span> <span class=\"nl\">&lt;http://www.w3.org/2000/01/rdf-schema#&gt;</span>\n",
       "<span class=\"k\">PREFIX</span> <span class=\"nn\">wd</span><span class=\"p\">:</span> <span class=\"nl\">&lt;http://www.wikidata.org/entity/&gt;</span>\n",
       "\n",
       "<span class=\"k\">SELECT</span> <span class=\"nv\">?diseaseLabel</span>\n",
       "<span class=\"k\">WHERE</span> <span class=\"p\">{</span>\n",
       "    <span class=\"nv\">?diseaseURI</span> <span class=\"k\">a</span> <span class=\"nn\">ns1</span><span class=\"p\">:</span><span class=\"nt\">Disease</span> <span class=\"p\">;</span>\n",
       "        <span class=\"nn\">rdfs</span><span class=\"p\">:</span><span class=\"nt\">label</span> <span class=\"nv\">?diseaseLabel</span> <span class=\"p\">;</span>\n",
       "        <span class=\"nn\">ns1</span><span class=\"p\">:</span><span class=\"nt\">hasCause</span> <span class=\"nv\">?causeURI</span> <span class=\"p\">.</span>\n",
       "    <span class=\"nv\">?causeURI</span> <span class=\"k\">a</span> <span class=\"nn\">ns1</span><span class=\"p\">:</span><span class=\"nt\">Cause</span> <span class=\"p\">;</span>\n",
       "        <span class=\"nn\">rdfs</span><span class=\"p\">:</span><span class=\"nt\">label</span> <span class=\"nv\">?causeLabel</span> <span class=\"p\">.</span>\n",
       "    <span class=\"k\">FILTER</span><span class=\"p\">(</span><span class=\"nf\">LCASE</span><span class=\"p\">(</span><span class=\"nv\">?causeLabel</span><span class=\"p\">)</span> <span class=\"o\">=</span> <span class=\"nf\">LCASE</span><span class=\"p\">(</span><span class=\"s\">&quot;food&quot;</span><span class=\"p\">))</span>\n",
       "<span class=\"p\">}</span>\n",
       "</pre></div>\n",
       "</body>\n",
       "</html>\n"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>diseaseLabel</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>food allergy</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "q1 = \"What causes does the disease 'food allergy' have'?\"\n",
    "q2 = \"What disease is caused by 'food'?\"\n",
    "\n",
    "x = multi_hop_questioning(q1, q2, graph, final_chain, memory)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "01202c99",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "None\n"
     ]
    }
   ],
   "source": [
    "print(x)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
